CSI API ETABS v1
cAreaObj.GetMaterialOverwrite Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMaterialOverwrite(
	string Name,
	ref string PropName
)
Function GetMaterialOverwrite (
	Name As String,
	ByRef PropName As String
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim PropName As String
Dim returnValue As Integer
returnValue = instance.GetMaterialOverwrite(Name,
	PropName)
int GetMaterialOverwrite(
	String^ Name,
	String^% PropName
)
abstract GetMaterialOverwrite :
        Name : string *
        PropName : string byref -> int
Parameters
Name
Type: System.String
PropName
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace